#Задача 2. 

'''
n = int(input("введите трехзначное число: "))
a = n//100
b = (n-a*100-n%10)//10
c = n%10
print(f'{a} + {b} + {c} = {a+b+c}')

'''
#  Задача 4. 
'''
p = int(input('как ты думаешь, сколько сделал журавликов Петя? Напиши: '))
print(f'{6*p} -> {p} {4*p} {p}')
'''

# Задача 6.
'''
x = input('введите шесть цифр номера Вашего билета: ')
s1 = int(x[0]) + int(x[1]) + int(x[2])
s2 = int(x[3]) + int(x[4]) + int(x[5])
if s1 == s2:
    print(f'yes')
else:
    print(f'no')
'''

# Задача 8.

m = int(input('введите количество долек в длину: '))
n = int(input('введите количество долек в ширину: '))
k = int(input('сколько долек Вы хотите отломить? '))
if k < m * n and (k % m == 0) or (k % n == 0):
    print('yes')
else:
    print('no')
